backend/app/controllers/api/v1/games_controller.rb

SELECT "games".* FROM "games"
---
  def index
    @game = Game.all

INSERT INTO "games" ("winning_score", "total_rounds", "winner_id", "game_data") VALUES ($1, $2, $3, $4) RETURNING "id"
---
  def create
    @game = Game.new(game_params)
    @game.game_data = game_api_call
    if @game.save