backend/app/controllers/api/v1/players_controller.rb

   def index
     @player = Player.all
---
SELECT "players".* FROM "players"